In [1]:
import numpy as np

In [63]:
arr1 = np.arange(18).reshape(6,3)
arr1

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14],
       [15, 16, 17]])

In [2]:
import pandas as pd

In [36]:
df = pd.read_excel(r"/Users/girish.tulabandu/personal/AIML-Breast-cancer-detection/Week 1 Dataset.xlsx")
df

  Name  Income per month          State  Age Sex  Number of siblings
0    A                50     Tamil Nadu   23   M                   0
1    B                34      Karnataka   37   F                   3
2    C                54     Tamil Nadu   35   F                   1
3    D                24  Uttar Pradesh   26   F                   4
4    E                19          Bihar   59   M                   5
5    F                21          Bihar   48   M                   6
6    G                40          Delhi   30   F                   2
7    H                20  Uttar Pradesh   72   M                  10
8    I                30      Telangana   22   F                   0
9    J                18    Chattisgarh   42   M                   7

In [37]:
df.head(3)

  Name  Income per month       State  Age Sex  Number of siblings
0    A                50  Tamil Nadu   23   M                   0
1    B                34   Karnataka   37   F                   3
2    C                54  Tamil Nadu   35   F                   1

In [38]:
df.tail(2)

  Name  Income per month        State  Age Sex  Number of siblings
8    I                30    Telangana   22   F                   0
9    J                18  Chattisgarh   42   M                   7

In [39]:
df1=df.rename(columns={"State":"State_name"})
df1

  Name  Income per month     State_name  Age Sex  Number of siblings
0    A                50     Tamil Nadu   23   M                   0
1    B                34      Karnataka   37   F                   3
2    C                54     Tamil Nadu   35   F                   1
3    D                24  Uttar Pradesh   26   F                   4
4    E                19          Bihar   59   M                   5
5    F                21          Bihar   48   M                   6
6    G                40          Delhi   30   F                   2
7    H                20  Uttar Pradesh   72   M                  10
8    I                30      Telangana   22   F                   0
9    J                18    Chattisgarh   42   M                   7

## Renaming all the colunmns

In [44]:
df2 = df.rename(columns={"Name":"FullName","Income per month":"salary per month", "State":"state name", "Age":"age in num","Sex":"Gender","Number of siblibngs":"siblings"})
df2

,FullName,salary per month,state name,age in num,Gender,Number of siblings
0,A,50,Tamil Nadu,23,M,0
1,B,34,Karnataka,37,F,3
2,C,54,Tamil Nadu,35,F,1
3,D,24,Uttar Pradesh,26,F,4
4,E,19,Bihar,59,M,5
5,F,21,Bihar,48,M,6
6,G,40,Delhi,30,F,2
7,H,20,Uttar Pradesh,72,M,10
8,I,30,Telangana,22,F,0
9,J,18,Chattisgarh,42,M,7

## Renaming without using extra df using inplace

In [43]:
df2.rename(columns={"FullName":"fullname"}, inplace=True)
df2

,fullname,salary per month,state name,age in num,Gender,Number of siblings
0,A,50,Tamil Nadu,23,M,0
1,B,34,Karnataka,37,F,3
2,C,54,Tamil Nadu,35,F,1
3,D,24,Uttar Pradesh,26,F,4
4,E,19,Bihar,59,M,5
5,F,21,Bihar,48,M,6
6,G,40,Delhi,30,F,2
7,H,20,Uttar Pradesh,72,M,10
8,I,30,Telangana,22,F,0
9,J,18,Chattisgarh,42,M,7

## Showing only columns sex and no of siblings

In [46]:
df2[["Gender", "Number of siblings"]]

  Gender  Number of siblings
0      M                   0
1      F                   3
2      F                   1
3      F                   4
4      M                   5
5      M                   6
6      F                   2
7      M                  10
8      F                   0
9      M                   7

In [50]:
df2.iloc[3:10, 1:5]

   salary per month     state name  age in num Gender
3                24  Uttar Pradesh          26      F
4                19          Bihar          59      M
5                21          Bihar          48      M
6                40          Delhi          30      F
7                20  Uttar Pradesh          72      M
8                30      Telangana          22      F
9                18    Chattisgarh          42      M

## To identify missing value columns

In [51]:
df2.isna().sum()

FullName              0
salary per month      0
state name            0
age in num            0
Gender                0
Number of siblings    0
dtype: int64

In [52]:
df2.describe()

       salary per month  age in num  Number of siblings
count          10.00000   10.000000           10.000000
mean           31.00000   39.400000            3.800000
std            13.18248   16.304055            3.259175
min            18.00000   22.000000            0.000000
25%            20.25000   27.000000            1.250000
50%            27.00000   36.000000            3.500000
75%            38.50000   46.500000            5.750000
max            54.00000   72.000000           10.000000

## count() gives total count

In [60]:
df2['Number of siblings'].count()

10

## value_counts() gives count of unique elements

In [61]:
df2["Gender"].value_counts()

M    5
F    5
Name: Gender, dtype: int64